Autodesk.Revit.DB.BeamMatchedTags.HasData
Returns true if any of the maps contain data
Returns:
True if any mappings exist, false otherwise
Since:
2027

Autodesk.Revit.DB.BeamMatchedTags.GetNewTagForOldId(System.Int32)
Searches all maps (faces and edges, fine and medium) for the given old tag and returns the new tag
oldId:
The old geometry tag to search for
Returns:
The new geometry tag if found, otherwise -1
Since:
2027

Autodesk.Revit.DB.BeamMatchedTags.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.BeamMatchedTags.#ctor(System.Collections.Generic.IDictionary{System.Int32,System.Int32},System.Collections.Generic.IDictionary{System.Int32,System.Int32},System.Collections.Generic.IDictionary{System.Int32,System.Int32},System.Collections.Generic.IDictionary{System.Int32,System.Int32})
map of old face index to new edge index (fine LoD)
map of old face index to new face index (fine LoD)
map of old face index to new edge index (medium LoD)
map of old edge index to new edge index (medium LoD)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.BeamMatchedTags
Constructs a new BeamMatchedTags object with face/edge mappings.
Properties with getters for direct access and modification
Since:
2027